DELETE  FROM book;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users(name, year) VALUES
('Андрей Иванов',2003),
('Николай Смирнов',2000),
('Петр Никитин',1999),
('Никита Алексеев',1986),
('Алексей Пономарев',1997),
('Илья Костючкин',2001),
('Анна Давыдова',1987),
('Ирина Алексеева',1983),
('Иван Поздняков',1991);

INSERT INTO book(name, author, year, user_id) VALUES
('Название 1','Автор 1',2005,null),
('Название 2','Автор 2',2021,null),
('Название 3','Автор 3',2010,null),
('Название 4','Автор 4',2020,null),
('Название 5','Автор 5',1998,null),
('Название 6','Автор 6',1934,null),
('Название 7','Автор 7',1984,null),
('Название 8','Автор 8',1976,null),
('Название 9','Автор 9',1956,null);
